cases/hydrodynamics/irregular_waves-5.0.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	(0 0 0)		//0
	(20 0 0)	//1
	(20 0.1 0)	//2
	(0 0.1 0)	//3	
	(0 0 2.5)	//4
	(20 0 2.5)	//5
	(20 0.1 2.5)	//6
	(0 0.1 2.5)	//7
	(0 0 7.5)	//8
	(20 0 7.5)	//9
	(20 0.1 7.5)	//10
	(0 0.1 7.5)	//11
	(0 0 10)	//12
	(20 0 10)	//13
	(20 0.1 10)	//14
	(0 0.1 10)	//15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 1 10) simpleGrading (1 1 0.333)
    hex (4 5 6 7 8 9 10 11) (150 1 90) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (150 1 10) simpleGrading (1 1 3)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)	
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
        );
    }
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
